export class Table {
  colsDesc: string[];
  rowsDesc: string[];
  matrix: number[][];


  constructor(colsDesc: string[], rowsDesc: string[], values: number[][]) {
    this.colsDesc = colsDesc;
    this.rowsDesc = rowsDesc;
    this.matrix = values;
  }
}


export let profTable = new Table(
  [
    'Швидкість та гнучкість мислення',
    'Вміння швидко приймати рішення',
    'Стійкість та концентрація уваги',
    'Зорова пам”ять ',
    'Швидкість реакції',
    'Рухлива пам”ять',
    'Фізична витривалість',
    'Координація рухів',
    'Емоційно-вольова стійкість',
    'Відповідальність'
  ],
  [
    'менеджер',
    'програміст',
    'шофер',
    'референт',
    'перекладач'
  ],
  [
    [0.9, 0.9, 0.8, 0.4, 0.5, 0.3, 0.6, 0.2, 0.9, 0.8],
    [0.8, 0.5, 0.9, 0.3, 0.1, 0.2, 0.2, 0.2, 0.5, 0.5],
    [0.3, 0.9, 0.6, 0.5, 0.9, 0.8, 0.9, 0.8, 0.6, 0.3],
    [0.5, 0.4, 0.5, 0.5, 0.2, 0.2, 0.3, 0.3, 0.9, 0.8],
    [0.7, 0.8, 0.8, 0.2, 0.6, 0.2, 0.2, 0.3, 0.3, 0.2]
  ]
);


export let candTable = new Table(
  [
    'Кандидат 1',
    'Кандидат 2',
    'Кандидат 3',
    'Кандидат 4',
    'Кандидат 5'
  ],
  [
    'Швидкість та гнучкість мислення',
    'Вміння швидко приймати рішення',
    'Стійкість та концентрація уваги',
    'Зорова пам”ять ',
    'Швидкість реакції',
    'Рухлива пам”ять',
    'Фізична витривалість',
    'Координація рухів',
    'Емоційно-вольова стійкість',
    'Відповідальність'
  ],
  [
    [0.9, 0.8, 0.7, 0.9, 1],
    [0.6, 0.4, 0.8, 0.5, 0.6],
    [0.5, 0.2, 0.3, 0.5, 0.9],
    [0.5, 0.9, 0.5, 0.5, 0.2],
    [1, 0.6, 0.5, 0.7, 0.8],
    [0.4, 0.5, 1, 0.7, 0.8],
    [0.5, 0.8, 0.9, 0.5, 0.4],
    [0.5, 0.6, 0.7, 0.6, 0.5],
    [0.8, 1, 0.2, 0.5, 0.6],
    [0.3, 0.5, 0.9, 0.6, 0.8],
  ]
);

export let resTable = new Table(
  [
    'Кандидат 1',
    'Кандидат 2',
    'Кандидат 3',
    'Кандидат 4',
    'Кандидат 5'
  ],
  [
    'менеджер',
    'програміст',
    'шофер',
    'референт',
    'перекладач'
  ],
  []
);
